print('Продавец вышел из склада, его сразу же зовет покупатьель ')
x=input('введите 1 что бы загасится от покупателя, 2 что бы подойти к покупатилю и узнать что ему нужно ')
if(x=='1'):
    print('Сопов увидел загас и дал пизды ')
    y=input('введите 1 что бы продолжать загас и уйти на кухню, 2 что бы подойти к покупателю ')
    if(y=='1'):
        print('Сопов заходит на кухню и выгоняет вас с работы, отныне вы безработный ')
    else:
        print('Вы идете так медлено к пакупателю что Ярик подошел первей и увел у вас продажу ')
else:
    print('Покупатель хочет купить какуюто хуйню под брендом Dexp ')
    y=input('Введите 1 что бы предложить норм технику, а лучше Sony, 2 что бы продать Dexp ')
    if(y=='1'):
        print('Вы красава! Вы продали Sony! ')
    else:
        print('Покупатель через час возвращает технику Dexp с руганью что вы его не предупредили что это херня полная, Сопов злой дает вам пизды ')
